[
  {
    "title": "Travel Planner",
    "slug": "TravelPlanner",
    "key": "1",
    "url": "https://react-travel-planner.netlify.com",
    "repo": "https://github.com/SonuToor/travel-planner",
    "image": "./images/itinerary-input.png",
    "mockup": "./images/travelplannermockup.png",
    "description": "This itinerary planning app allows you to create a trip, then organize all your relevant travel info in one place.",
    "fullDescription": "This travel planner web app is for anyone who feels overwhelmed when initially crafting their itinerary. This web app allows a user to select their destination, then input their dates for their trip. The app then organizes and displays the trip in an easy to digest format. It separates the trip into separate days, then each day into morning, afternoon, evening and night. The user can then input the different events for each day and time, they can input flights and trains and even accommodation. The web app also allows for exporting the itinerary events to the user's Google Calendar. ",
    "tools": "React.js, Material UI, Google Firebase, Google Calendars API, Google Places API"
  },
  {
    "title": "If-Me",
    "slug": "IfMe",
    "key": "2",
    "url": "https://www.if-me.org/",
    "repo": "https://github.com/ifmeorg/ifme",
    "image": "./images/billsplitter-preview.png",
    "mockup": "./images/ifmemockup.png",
    "description": "If-Me is an open source mental health platform for sharing your mental health experiences with trusted allies.",
    "fullDescription": "If-Me is an open source platform that allows users to share moments, moods, and strategies with trusted allies, provides access to resources and even helps track medication. My major contribution to this project is the text input autocomplete. This component responds to a users input by filtering selection options, it then displays a 'tag' based on the users selection. This component is used throughout the platform, one example being the resources page which is pictured above.",
    "tools": "React.js, Ruby on Rails, Jest, Enzyme, PostgreSQL, Rspec, Capybara, Storybook, Circle CI"
  }
]
